#region Using framework
using System;
using System.Collections.Generic;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
#endregion


///старый

namespace Pluton.GUI
{
    ///------------------------------------------------------------------------------------------
    using Pluton;
    using Pluton.SystemProgram;
    using Pluton.SystemProgram.Devices;
    ///------------------------------------------------------------------------------------------







    ///=========================================================================================
    ///
    /// <summary>
    /// GUI контрол
    /// горизонтальный список прокрутки
    /// </summary>
    /// 
    ///------------------------------------------------------------------------------------------
    public class AScrollAreaHorizontal
                :
                    AScrollHorizontal
    {

        ///--------------------------------------------------------------------------------------
        private List<AWidget>   mItem = new List<AWidget>();//привязанные элементы
        private int             mItemWidth = 0; //максимальный размер контролов в списке


        /// количество столбцов
        private int             mRowCount           = 1;
        private int             mVerticalSpacing    = 0; //отступы между вертикальными элементами
        private bool            mAutoCenter         = false; //автоцентрирование по вертикали
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AScrollAreaHorizontal(AWidget parent)
            :
            base(parent, 0, 0, 0, 0)
        {
        }
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AScrollAreaHorizontal(AWidget parent, int left, int top, int width, int height)
            :
            base(parent, left, top, width, height)
        {
        }
        ///--------------------------------------------------------------------------------------









        ///=====================================================================================
        ///
        /// <summary>
        /// Удалить все данные
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void removeAll()
        {
            mItem.Clear();
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Добавление в список виджета
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void addItem(AWidget item)
        {
            mItem.Add(item);
            if (item.width > mItemWidth)
            {
                mItemWidth = item.width;
            }
            refresh();
        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// Количество элементов
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public int countItem
        {
            get
            {
                return mItem.Count;
            }
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Возвратим элемент по его индексу
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AWidget item(int index)
        {
            return (index >= 0 && index < mItem.Count) ? mItem[index] : null;
        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// поиск виджетов потомков
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override AWidget onFindChilds(string name)
        {
            AWidget find = base.onFindChilds(name);
            if (find == null)
            {
                foreach (AWidget child in mItem)
                {
                    find = child.findWidgetName(name);
                    if (find != null)
                    {
                        return find;
                    }
                }
            }
            return find;

        }
        ///--------------------------------------------------------------------------------------









        ///=====================================================================================
        ///
        /// <summary>
        /// Скроллируем в указанную позицию
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void scrollToIndex(int index)
        {
            scrollCenter(index / (mRowCount == 0 ? 1 : mRowCount));
        }
        ///--------------------------------------------------------------------------------------









        ///=====================================================================================
        ///
        /// <summary>
        /// Установка количества колонок
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void setRowCount(int rowCount)
        {
            mRowCount = rowCount;
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// расстояние между элементами
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public int verticalSpacing
        {
            get
            {
                return mVerticalSpacing;
            }
            set
            {
                mVerticalSpacing = value;
            }
        }
        ///--------------------------------------------------------------------------------------




         ///=====================================================================================
        ///
        /// <summary>
        /// автоматическое центирование по вертикали, для одного элемента
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool autoCenter
        {
            get
            {
                return mAutoCenter;
            }
            set
            {
                mAutoCenter = value;
            }
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Ширина текстовой строчки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override int onItemWidth()
        {
            return mItemWidth;
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Количество строчек
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override int onItemCount()
        {
            int iCount = mItem.Count / mRowCount;
            if ((mItem.Count % mRowCount) != 0)
            {
                iCount++;
            }
            return iCount;
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// Отрисовка контрола с учетом располжения родителя
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onRenderItem(ASpriteBatch spriteBatch, Rectangle rect, int index)
        {
            int id = index * mRowCount;
            for (int i = 0; i < mRowCount; i++)
            {
                if (id >= mItem.Count)
                {
                    break;
                }
                AWidget item = mItem[id];
                item.render(spriteBatch);
                id++;
            }
            //spriteBatch.primitives.drawBorder(rect, 2, Color.Blue);
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// опрос одного элемента
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override bool onHandleInputItem(AInputDevice input, int index)
        {
            bool okInput = false;
            if (index >= 0)
            {

                int id = index * mRowCount;
                for (int i = 0; i < mRowCount; i++)
                {
                    if (id >= mItem.Count)
                    {
                        break;
                    }
                    AWidget item = mItem[id];
                    if (item.onHandleInput(input))
                    {
                        return true;
                    }
                    id++;
                }
            }
            else
            {
                foreach (AWidget obj in mItem)
                {
                    if (obj.onHandleInput(input))
                    {
                        okInput = true;
                    }
                }
            }
            return okInput;
        }
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// изменение размеров одного элемента
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onUpdatePositionItem(Rectangle rectItem, int index)
        {
            int iLeft = rectItem.Left;

            if (mRowCount == 1)
            {
                int frameHeight = contentHeight;
                int iiTop = rectItem.Top;

                AWidget item = mItem[index];

                if (mAutoCenter)
                {
                    iiTop = (frameHeight - item.height) / 2;
                }

                item.left = iLeft;
                item.top = iiTop;
                return;
            }



            int id = index * mRowCount;
            int iTop = rectItem.Top;
            for (int i = 0; i < mRowCount; i++)
            {
                if (id >= mItem.Count)
                {
                    break;
                }
                AWidget item = mItem[id];
                int iHeight = item.height;
                item.left = iLeft;
                item.top = iTop;

                iTop += iHeight + mVerticalSpacing;
                id++;
            }
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Скроллинг на предыдущий лот
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void scrollPrev()
        {
            int iBegin = 0;
            int iEnd = 0;
            visibleIndex(ref iBegin, ref iEnd);

            if (iBegin < 0)
            {
                return;
            }

            int idx = iBegin + (iEnd - iBegin) / 2;
            idx--;
            if (idx >= 0 && idx < onItemCount())
            {
                scrollCenterMove(idx);
            }
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// Скроллинг на последующий лот
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void scrollNext()
        {
            int iBegin = 0;
            int iEnd = 0;
            visibleIndex(ref iBegin, ref iEnd);

            if (iEnd >= onItemCount())
            {
                return;
            }

            int idx = iBegin + (iEnd - iBegin) / 2;
            idx++;
            if (idx >= 0 && idx < onItemCount())
            {
                scrollCenterMove(idx);
            }
        }
        ///--------------------------------------------------------------------------------------



    }
}
