#region Using framework
using System;
using System.Net.Http;
using System.Text;
#endregion





namespace Pluton.SystemProgram.Devices
{
    ///--------------------------------------------------------------------------------------
    ///--------------------------------------------------------------------------------------







    ///=====================================================================================
    ///
    /// <summary>
    /// Команды отправляемые на сервер
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AWebCommand
            :
                AWebQuery
    {
        ///--------------------------------------------------------------------------------------
        private static readonly string cURL = "http://candypeppypum.miracel.info/api/";   //запрос на установку соеденения
        private static readonly int cVersionAPI = 1; //версия протокола
        ///--------------------------------------------------------------------------------------
        public static readonly Uri cURI = new Uri(cURL);


        ///--------------------------------------------------------------------------------------
        public readonly AWebParameters parameters = new AWebParameters();
        public AWebParameters result = null; //результат выполнения команды
        ///--------------------------------------------------------------------------------------




        ///--------------------------------------------------------------------------------------
        private string mData = null;
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AWebCommand()
        {
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AWebCommand(string cmd)
        {
            parameters.addString("cmd", cmd);
        }
        ///--------------------------------------------------------------------------------------









        ///=====================================================================================
        ///
        /// <summary>
        /// преобразование команды в текст для отправки на сервер
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public string toString()
        {
            return parameters.toString();
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// начало выполнения команды
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onSend()
        {
            parameters.addInteger("deviceID", network.deviceID);
            parameters.addInteger("ver", cVersionAPI);
            sendHttp();
            /*
                        web.Headers["Content-Type"] = "application/x-www-form-urlencoded";
                        web.Encoding = Encoding.UTF8;
                        web.UploadStringAsync(cURI, "POST", parameters.toString(), this);*/
        }
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// выполнение команды
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected async void sendHttp()
        {
            var content = new StringContent(parameters.toString(), Encoding.UTF8, "application/x-www-form-urlencoded");
            using (var data = await network.http.PostAsync(cURI, content))
            {
                mData = data.Content.ReadAsStringAsync().Result;
                result = new AWebParameters(mData);
                executeCompleted();
            }
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// команда выполнилась
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        /*
        protected override void onExecute(string data)
        {
            mData = data;
            result = new AWebParameters(data);
        }*/
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// очистить всю команду
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onClear()
        {
            parameters.clear();
            result = null;
            mData = null;
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// возвратить текст сообщения
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public string resultText
        {
            get
            {
                return mData;
            }
        }
        ///--------------------------------------------------------------------------------------









    }
}
