#region Using framework
using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
#endregion




namespace Pluton.GUI
{
    ///------------------------------------------------------------------------------------------

    ///------------------------------------------------------------------------------------------






    ///=========================================================================================
    ///
    /// <summary>
    /// Штуковина, которая вертикально располаживает виджеты
    /// </summary>
    /// 
    ///------------------------------------------------------------------------------------------
    public class AAlignVertical
            :
                AAlignFrame
    {

        ///--------------------------------------------------------------------------------------
        private readonly bool mResizeWidth = false;
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAlignVertical(AFrame frame)
            :
                base(frame)
        {

        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 2
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAlignVertical(AFrame frame, bool resizeWidth)
            :
                base(frame)
        {
            mResizeWidth = resizeWidth;
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// пересборка содержимого фрейма
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onResize()
        {
            //пробежимся по всем системным кнопкам, и выставим им позицию по умолчанию
            int iWidth = frame.contentWidth;
            int iTop = 0;
            foreach (AWidget obj in frame.childs)
            {
                if (obj is ADockwidgetButton)
                {
                    continue;
                }

                if (mResizeWidth)
                {
                    obj.left = 0;
                    obj.width = iWidth;
                }
                else
                {
                    obj.left = (iWidth - obj.width) / 2;
                }
                
                
                obj.top = iTop;
                iTop += obj.height;
            }
        }
        ///--------------------------------------------------------------------------------------














    }
}
