#region Using framework
using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
#endregion




namespace Pluton.GUI
{
    ///------------------------------------------------------------------------------------------

    ///------------------------------------------------------------------------------------------






     ///=========================================================================================
    ///
    /// <summary>
    /// Штуковина, которая горизонтально располаживает виджеты
    /// </summary>
    /// 
    ///------------------------------------------------------------------------------------------
    public class AAlignHorizontalCenter
            :
                AAlignFrame
    {

        ///--------------------------------------------------------------------------------------
        private readonly bool mResizeHeight = false;
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAlignHorizontalCenter(AFrame frame)
            :
                base(frame)
        {

        }
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 2
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAlignHorizontalCenter(AFrame frame, bool resizeHeight)
            :
                base(frame)
        {
            mResizeHeight = resizeHeight;
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// пересборка содержимого фрейма
        /// выставим всех по горизонтали
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onResize()
        {
            //сначала выесним общий размер всех контролов
            int iWidthAll = 0;
            int iCount = 0;
            foreach (AWidget obj in frame.childs)
            {
                if (obj is ADockwidgetButton)
                {
                    continue;
                }
                iWidthAll += obj.width;
                iCount++;
            }

            int iLeft = (frame.contentWidth - iWidthAll) / 2;

            
          
            //пробежимся по всем системным кнопкам, и выставим им позицию по умолчанию
            int iHeight = frame.contentHeight;
            foreach (AWidget obj in frame.childs)
            {
                if (obj is ADockwidgetButton)
                {
                    continue;
                }

                if (mResizeHeight)
                {
                    obj.top = 0;
                    obj.height = iHeight;
                }
                else
                {
                    obj.top = (iHeight - obj.height) / 2;
                }

                obj.left = iLeft;
                iLeft += obj.width;
            }
        }
        ///--------------------------------------------------------------------------------------














    }
}
