using System;
using Microsoft.Xna.Framework;
using System.Collections.Generic;
using Microsoft.Phone.Tasks;
using Microsoft.ApplicationInsights;

namespace Pluton.SystemProgram.Devices
{
    ///--------------------------------------------------------------------------------------
    using HexoTree_WP8;
    ///--------------------------------------------------------------------------------------





     ///=====================================================================================
    ///
    /// <summary>
    /// —истема аналитики приложени€
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAnalytics
    {
        ///--------------------------------------------------------------------------------------
         









         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAnalytics()
        {
            gAnalytics.setInstance(this);


        }
        ///--------------------------------------------------------------------------------------



      


         ///=====================================================================================
        ///
        /// <summary>
        /// Ќачало запуска программы
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void startSession()
        {

        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// выключение сесси
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void endSession()
        {

        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// обработка ошибок
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void logError(string message, Exception e)
        {
            /*
#if ANALYTICS  
            string sError = message + " -> M:" + e.Message + "; S:" + e.StackTrace;
            FlurryWP8SDK.Api.LogError(sError, e);
            MessageBox.Show("Dear user, There was error in the programm. Fix it in the next version. Thanks!", "Error", MessageBoxButton.OK);

            try
            {
                EmailComposeTask emailComposeTask = new EmailComposeTask();

                emailComposeTask.Subject = "Error";
                emailComposeTask.Body = sError;
                emailComposeTask.To = "error@robotrek.info";
                emailComposeTask.Show();
            }
            catch (Exception)
            {
            }
            //mDeviceGame.Exit();
            
#endif*/
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// начало выполнени€ сообщени€
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void beginEvent(string eventName)
        {
            /*
            var telemetry = App.TelemetryClient;
            if (telemetry == null)
            {
                return;
            }
            */

        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// конец выполнени€ сообщени€
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void endEvent(string eventName)
        {

        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// событие с параметром
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void eventParam(string eventName, string paramName)
        {

        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// событие c параметрами
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void trackEvent(string eventName, IDictionary<string, string> properties)
        {
            if (properties == null)
            {
                App.TelemetryClient.TrackEvent(eventName);
            }
            else
            {
                App.TelemetryClient.TrackEvent(eventName, properties);
            }
        }
        ///--------------------------------------------------------------------------------------




        
        
         ///=====================================================================================
        ///
        /// <summary>
        /// ошибка
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void trackException(Exception ex)
        {
            App.TelemetryClient.TrackException(ex);
        }
        ///--------------------------------------------------------------------------------------



    }
}
