#region Using framework
using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;
#endregion



namespace Pluton.GraphicsElement
{
    ///--------------------------------------------------------------------------------------
    using Pluton.SystemProgram;
    ///--------------------------------------------------------------------------------------









     ///=====================================================================================
    ///
    /// <summary>
    /// Описание камеры 
    /// 
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public interface ICamera
    {
        ///--------------------------------------------------------------------------------------









         ///=====================================================================================
        ///
        /// <summary>
        /// Возвращаем экранные координаты, на входе логические координаты
        /// возвращаем, данная точка поместится на экран или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        bool getParticleScreen(ref Vector2 pos, ref float scale);
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Возвращаем экранные координаты, на входе логические координаты
        /// возвращаем, данная точка поместится на экран или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        bool getPositionToScreen(ref Vector2 pos, ref float scale);
        ///--------------------------------------------------------------------------------------









    }
    ///--------------------------------------------------------------------------------------











}
