#region Using framework
using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
#endregion


using Pluton;
using Pluton.SystemProgram;
using Pluton.SystemProgram.Devices;

namespace Pluton.GUI
{







    ///=========================================================================================
    ///
    /// <summary>
    /// Кнопка c надписью и прикрученными данными
    /// 
    /// </summary>
    /// 
    ///------------------------------------------------------------------------------------------
    public class AButtonTextData
                    :
                        AButtonText
    {
        ///--------------------------------------------------------------------------------------
        private object mData = null;
        ///--------------------------------------------------------------------------------------









        ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonTextData(AFrame parent, string text, int left, int top, object data)
            : base(parent, text, left, top)
        {
            this.text = text;
            mData = data;
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonTextData(AFrame parent, string text, int left, int top)
            : 
            this(parent, text, left, top, null)
        {
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// возвратим данные
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public object data
        {
            get
            {
                return mData;
            }
            set
            {
                mData = value;
            }

        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Обработка нажатия на кнопку c данными
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public delegate void eventClickData(object data);
        public event eventClickData signal_clickData;
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// обработка нажатия на кнопку
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onClick()
        {
            if (signal_clickData != null)
            {
                signal_clickData(mData);
            }
        }
        ///--------------------------------------------------------------------------------------













    }
}
