#region Using framework
using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Graphics;
#endregion


using Pluton;
using Pluton.SystemProgram;
using Pluton.SystemProgram.Devices;

namespace Pluton.GUI
{







     ///=========================================================================================
    ///
    /// <summary>
    /// Кнопка ввиде иконки
    /// с надписью
    /// 
    /// </summary>
    /// 
    ///------------------------------------------------------------------------------------------
    public class AButtonIconText
                    :
                        AButtonIcon
    {
        ///--------------------------------------------------------------------------------------
        private string      mText           = string.Empty; //текст кнопки
        private Vector2     mTextPosition   = Vector2.Zero; //централизация текста у кнопки
        private Vector2     mTextScale      = new Vector2(1.0f); //размер текста чтобыы вс янадпись влезла
        private SpriteFont  mTextFont       = AFonts.small; //шрифт
        private Color       mTextColor      = Color.White;  //цвет текста
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonIconText(uint spriteIcon)
            :
                base(spriteIcon)
        {

        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonIconText(AWidget parent, uint spriteIcon)
            :
                base(parent, spriteIcon)
        {

        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 2
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonIconText(AWidget parent, uint spriteIcon, uint spriteButton)
            :
                base(parent, spriteIcon, spriteButton)
        {
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 3
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonIconText(AWidget parent, uint spriteIcon, int left, int top)
            :
                base(parent, spriteIcon, left, top)
        {
        }
        ///--------------------------------------------------------------------------------------




         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор 5
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonIconText(AWidget parent, uint spriteIcon, uint spriteButton, int left, int top)
            :
                base(parent, spriteIcon, spriteButton, left, top)
        {
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Конструктор
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AButtonIconText(AWidget parent, uint spriteIcon, uint spriteIconCheck, uint spriteButton, int left, int top)
            : base(parent, spriteIcon, spriteIconCheck, spriteButton, left, top)
        {
        }
        ///--------------------------------------------------------------------------------------






      
         ///=====================================================================================
        ///
        /// <summary>
        /// установка текста
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public string text
        {
            get
            {
                return mText;
            }
            set
            {
                mText = value;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// установка позиции текста
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public Vector2 textPosition
        {
            get
            {
                return mTextPosition;
            }
            set
            {
                mTextPosition = value;
            }
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// установка цвет текста
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public Color textColor
        {
            get
            {
                return mTextColor;
            }
            set
            {
                mTextColor = value;
            }
        }
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// Отрисовка контрола
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        protected override void onRender(ASpriteBatch spriteBatch)
        {
            base.onRender(spriteBatch);
            
            float fAlpha = alpha;
            float fScale = 1.0f;


            //отрисуем название
            Vector2 ptPos = screenCenter + mTextPosition;
            //отрисовка тени на словом



            spriteBatch.DrawString(mTextFont, mText, ptPos, mTextColor * fAlpha, 0.0f, Vector2.Zero, mTextScale * fScale, SpriteEffects.None, 0.0f);
            
            
        }
        ///--------------------------------------------------------------------------------------













    }
}
