#region Using framework
using System;
using Microsoft.Phone.Tasks;
using Microsoft.Phone.Marketplace;
#endregion





namespace Pluton.SystemProgram.License
{
    ///--------------------------------------------------------------------------------------
    using Pluton.SystemProgram.Devices;
    ///--------------------------------------------------------------------------------------








     ///=====================================================================================
    ///
    /// <summary>
    /// Лицензия регламинтирующая использоавние данной программы
    /// свободная лицензия, без рекламы
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class ALicense
    {
        ///--------------------------------------------------------------------------------------
        private readonly ADevices mDevice = null;

        private bool mActive = false; //активация переменных
        private bool mIsTrial = true; //куплена или нет игра //true - используется триальная версия false - игра куплена
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public ALicense(ADevices device)
        {
            mDevice = device;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка настроек
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void loadSettings(AStorage settings)
        {
            bool licFirst = settings.readBoolean("lic1", true);
            if (licFirst)
            {
                return;
            }

            bool licActive = settings.readBoolean("lic2", false);
            bool licIsTrial = settings.readBoolean("lic3", true);


            if (!licIsTrial && licActive)
            {
                //игра активирована
                mActive = true;
                mIsTrial = false;
                return;
            }

            //игра требует проверки либо активации
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// Сохранение настроек
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void saveSettings(AStorage settings)
        {
            settings.writeBoolean("lic1", false);
            settings.writeBoolean("lic2", mActive);
            settings.writeBoolean("lic3", mIsTrial);
        }
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// узнаем игру выполняется в триальном, урезанном виде или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isTrial()
        {
            checkLicense();
            return mIsTrial;
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// узнаем игру можно купить или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isBuyPremium()
        {
            checkLicense();
            return mIsTrial;
        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// Пкупка премиальной версии игры
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void buyPremium()
        {
            try
            {
                MarketplaceDetailTask md = new MarketplaceDetailTask();
                md.Show();
            }
            catch (Exception)
            {

            }
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Активация премиальной версии игры
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void activationPremium()
        {
            try
            {
                MarketplaceDetailTask md = new MarketplaceDetailTask();
                md.ContentIdentifier = "fac7f6e6-cf84-4f30-bc2f-f23b33066e4a";
                md.Show();
            }
            catch (Exception)
            {

            }
        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// активация лицензии
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        private void checkLicense()
        {
            if (mActive)
            {
                return;
            }


            var info = new LicenseInformation();
            mIsTrial = info.IsTrial();

#if DEBUG
            mIsTrial = true;
#endif

            mActive = true;
        }
        ///--------------------------------------------------------------------------------------




    }
    ///--------------------------------------------------------------------------------------







}
