#region Using framework
using System;
using System.Collections.Generic;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;
#endregion



namespace Pluton.SystemProgram.Devices
{
    ///--------------------------------------------------------------------------------------

 



     ///=====================================================================================
    ///
    /// <summary>
    /// Глобальный доступ для аналитики
    /// 
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class gAnalytics
    {
        





         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public gAnalytics()
        {


        }
        ///--------------------------------------------------------------------------------------




                        



         ///=====================================================================================
        ///
        /// <summary>
        /// событие c параметрами
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public static void trackEvent(string eventName, IDictionary<string, string> properties)
        {
            var app = AApp.instance;
            if (app != null)
            {
                app.screenManager.devices.analytics.trackEvent(eventName, properties);
            }
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// ошибка
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public static void trackException(Exception ex)
        {
            var app = AApp.instance;
            if (app != null)
            {
                app.screenManager.devices.analytics.trackException(ex);
            }
        }
        ///--------------------------------------------------------------------------------------







        ///--------------------------------------------------------------------------------------




    }
}
