using System;
using System.Collections.Generic;

#if (APPODEAL)

namespace Pluton.SystemProgram.Devices
{
    ///--------------------------------------------------------------------------------------
    using Com.Appodeal.Ads;
    using Android.App;
    ///--------------------------------------------------------------------------------------














    ///=====================================================================================
    ///
    /// <summary>
    /// Система рекламы от appodeal.com
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAdvertisement_appodeal
        :
            Activity,
            IADS,
            IRewardedVideoCallbacks
    {
        ///--------------------------------------------------------------------------------------
        private readonly Activity mActivity = null;
        private eventAds mSignal_completed = null;
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAdvertisement_appodeal(Activity activity, string appKey)
        {
#if (APPODEAL_TEST)
            Appodeal.SetTesting(true);
            Appodeal.SetLogging(true);
#endif
            mActivity = activity;
            Appodeal.Initialize(mActivity, appKey, Appodeal.REWARDED_VIDEO);
            Appodeal.SetRewardedVideoCallbacks(this);
        }
        ///--------------------------------------------------------------------------------------









         ///=====================================================================================
        ///
        /// <summary>
        /// проверка, доступна сейчас реклама или нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isAdAvailable()
        {
            return Appodeal.IsLoaded(Appodeal.REWARDED_VIDEO);
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// показ рекламы, после ее показа запускаем обратный метод
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool show(eventAds signal_completed)
        {
            mSignal_completed = signal_completed;
            if (Appodeal.Show(mActivity, Appodeal.REWARDED_VIDEO))
            {
                return true;
            }
            mSignal_completed = null;
            return false;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// реклама загружена
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void OnRewardedVideoLoaded()
        {
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// реклама с ошибками
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void OnRewardedVideoFailedToLoad()
        {
            if (mSignal_completed != null)
            {
                mSignal_completed(false);
                mSignal_completed = null;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// реклама показыается
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void OnRewardedVideoShown()
        {
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// реклама закрывается
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void OnRewardedVideoClosed()
        {
            if (mSignal_completed != null)
            {
                mSignal_completed(false);
                mSignal_completed = null;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// реклама закончена
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void OnRewardedVideoFinished(int p0, string p1)
        {
            if (mSignal_completed != null)
            {
                mSignal_completed(true);
                mSignal_completed = null;
            }
        }
        ///--------------------------------------------------------------------------------------










    }
}
#endif