#region Using framework
using System;
using System.Collections.Generic;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Media;
using Microsoft.Xna.Framework.Content;
#endregion





namespace Pluton.SystemProgram.Devices
{
    ///--------------------------------------------------------------------------------------
    using Microsoft.Xna.Framework.Media;
    ///--------------------------------------------------------------------------------------






    ///=====================================================================================
    ///
    /// <summary>
    /// Фоновая музыка
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AMusicDevice
    {
        ///--------------------------------------------------------------------------------------
        private bool mEnabled = false; //включена выключена музыка
        private Song mCurrentSong = null; //текущая музыка которая играет

        private Dictionary<string, Song> mMusics = new Dictionary<string, Song>();
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AMusicDevice()
        {
            setDefault();
        }
        ///--------------------------------------------------------------------------------------















         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка основной музкыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void loadContent(ContentManager content)
        {
            foreach (var name in AFrameworkSettings.musics)
            {
                loadMusic(name, content);
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка контента музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        private void loadMusic(string name, ContentManager content)
        {
            var ms = content.Load<Song>("Music\\" + name);
            mMusics[name] = ms;
        }
        ///--------------------------------------------------------------------------------------













         ///=====================================================================================
        ///
        /// <summary>
        /// Загрузка настроек
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void loadSettings(AStorage settings)
        {
            bool save = mEnabled;
            mEnabled = settings.readBoolean("music", mEnabled);
            if (!save)
            {
                mEnabled = false;
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Сохранение настроек
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void saveSettings(AStorage settings)
        {
            settings.writeBoolean("music", mEnabled);
        }
        ///--------------------------------------------------------------------------------------
       







         ///=====================================================================================
        ///
        /// <summary>
        /// Установка музыки по умолчанию
        /// если на фоне ничего не играет, то галка поумолчанию будет вклчена
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void setDefault()
        {
            try
            {
                mEnabled = MediaPlayer.State != MediaState.Playing;
            }
            catch 
            {
                mEnabled = true;
            }
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Включенна выключена фоновая музыка
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool enabled
        {
            get
            {
                return mEnabled;
            }
            set
            {
                mEnabled = value;
                if (mEnabled)
                {
                    if (MediaPlayer.State != MediaState.Playing)
                    {
                        play();
                    }
                }
                else
                {
                    if (MediaPlayer.State != MediaState.Stopped)
                    {
                        MediaPlayer.Stop();
                    }
                }
            }
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// Проигрывание музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void playRepeat(string name)
        {
            if (mMusics.ContainsKey(name))
            {
                playRepeat(mMusics[name]);
            }
        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// Проигрывание музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void playRepeat(Song song)
        {
            if (mEnabled && mCurrentSong != song)
            {
                mCurrentSong = song;
                play();
            }
            else
            {
                mCurrentSong = song;
            }

        }
        ///--------------------------------------------------------------------------------------








        ///=====================================================================================
        ///
        /// <summary>
        /// Проигрывание музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void play()
        {
            if (mCurrentSong != null)
            {
                try
                {
                    MediaPlayer.IsRepeating = true;
                    //MediaPlayer.IsVisualizationEnabled = false;
                    MediaPlayer.Play(mCurrentSong);
                }
                catch (Exception e)
                {
                    gAnalytics.trackException(e);
                    mCurrentSong = null;
                }
            }
        }
        ///--------------------------------------------------------------------------------------




         ///=====================================================================================
        ///
        /// <summary>
        /// Остановка проигрывания музыки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void playStop()
        {
            if (mCurrentSong != null)
            {
                try
                {
                    MediaPlayer.Stop();
                }
                catch (Exception e)
                {
                    gAnalytics.trackException(e);
                }
                mCurrentSong = null;
            }
        }
        ///--------------------------------------------------------------------------------------






    }
}
