using System;
using Microsoft.Xna.Framework;
using System.Collections.Generic;
using Microsoft.Phone.Tasks;


namespace Pluton.SystemProgram.Devices
{
    ///--------------------------------------------------------------------------------------





    ///=====================================================================================
    ///
    /// <summary>
    /// Система аналитики приложения
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAnalytics_flurry
        :
            IAnalytics
    {
        ///--------------------------------------------------------------------------------------
        private readonly string mSessionID = null;
        ///--------------------------------------------------------------------------------------










         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAnalytics_flurry(string sessionID)
        {
            mSessionID = sessionID;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Начало запуска программы
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void startSession()
        {
            FlurryWP8SDK.Api.StartSession(mSessionID);
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// выключение сесси
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void endSession()
        {
            FlurryWP8SDK.Api.EndSession();
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// событие c параметрами
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void trackEvent(string eventName, IDictionary<string, string> properties)
        {
            if (properties != null)
            {
                var param = new List<FlurryWP8SDK.Models.Parameter>();
                foreach (var key in properties.Keys)
                {
                    param.Add(new FlurryWP8SDK.Models.Parameter(key, properties[key]));
                }
                FlurryWP8SDK.Api.LogEvent(eventName, param);
            }
            else
            {
                FlurryWP8SDK.Api.LogEvent(eventName);
            }
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// ошибка
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void trackException(Exception ex)
        {
            FlurryWP8SDK.Api.LogError(ex.Message, ex);
        }
        ///--------------------------------------------------------------------------------------













 



    }
}
