#region Using framework
using System;
using System.Text;
#endregion





namespace Pluton.Utils.Hash
{
    ///--------------------------------------------------------------------------------------





    ///=====================================================================================
    ///
    /// <summary>
    /// Система подсчета хеша
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    class AMD5
    {
        public static string fromString(string value)
        {
            string result = libMD5.GetHashString(value);
            return result;
        }

    }
    ///--------------------------------------------------------------------------------------






    ///=====================================================================================
    ///
    /// <summary>
    /// Система шифрования
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    class ACryption
    {
        ///--------------------------------------------------------------------------------------
        //private readonly CryptographyHelper mCrypto = null;
        private readonly string mKey = string.Empty;
        ///--------------------------------------------------------------------------------------





        ///=====================================================================================
        ///
        /// <summary>
        /// constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public ACryption(string secretKey)
        {
            mKey = secretKey;
            //mCrypto = new CryptographyHelper();
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// Шифрование строки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public byte[] encryptString(string data)
        {
            byte[] sCrypt = null;
            try
            {
                //sCrypt = mCrypto.EncryptAES(data, mKey);
                sCrypt = Encoding.UTF8.GetBytes(data);
            }
            catch (Exception)
            {
                sCrypt = null;
            }
            return sCrypt != null ? sCrypt : new byte[0];
        }
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// расшифрование строки
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public string decryptString(byte[] data)
        {
            if (data == null)
            {
                return string.Empty;
            }
            string ss = string.Empty;
            try
            {
                //            ss = mCrypto.DecryptAES(data, mKey);

                ss = Encoding.UTF8.GetString(data, 0, data.Length);
            }
            catch (Exception)
            {
                ss = string.Empty;
            }
            return ss;
        }
        ///--------------------------------------------------------------------------------------


    }
}
