#region Using framework
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;
using System;
#endregion


namespace Pluton.SystemProgram
{
    public class ADateTime
    {
        ///--------------------------------------------------------------------------------------
        public static DateTimeOffset current;
        ///--------------------------------------------------------------------------------------

        private double mSeconds = 0; //текущее окличество секунд для отчета






         ///=====================================================================================
        ///
        /// <summary>
        /// constructor
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public ADateTime()
        {
            current = DateTimeOffset.Now;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// добавление к дате новых данных
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void add(TimeSpan time)
        {
            mSeconds += time.TotalSeconds;
            if (mSeconds > 1.0f)
            {
                current = current.AddSeconds(mSeconds);
                mSeconds = 0;
            }
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// инциализация времени
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void init()
        {
            current = DateTimeOffset.Now;
        }
        ///--------------------------------------------------------------------------------------




    }
}