using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;


using Pluton.SystemProgram;


namespace Pluton.GraphicsElement
{
    ///--------------------------------------------------------------------------------------







     ///=====================================================================================
    ///
    /// <summary>
    /// Энимационный элемент
    /// проигрывает одну анимацию - туда от 0 до 1
    /// 
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAnimationOnce
    {
        ///--------------------------------------------------------------------------------------
        private float           m_speed = 0;   //скорость перемещения
        private float           m_diff = 0;  //текущее изменение от 0 до 1;
        private ETypeState      m_state = ETypeState.stop;
        ///--------------------------------------------------------------------------------------




        ///--------------------------------------------------------------------------------------
        /// <summary>
        /// Текущее деййствия состояние машины
        /// </summary>
        protected enum ETypeState
        {
            stop,

            /// <summary>
            /// анимируем в одну сторону
            /// </summary>
            forward
        };
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// speed - скорость продолжительности анимации в милисикундах
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAnimationOnce(float speed)
        {
            m_speed = 1 / speed;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// возвратить  текущее значение анимации от 0..1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public static implicit operator float(AAnimationOnce p)
        {
            return p.m_diff;
        }
        ///--------------------------------------------------------------------------------------










         ///=====================================================================================
        ///
        /// <summary>
        /// обработка анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void update(TimeSpan gameTime)
        {
            switch (m_state)
            {
                case ETypeState.forward:
                    {
                        m_diff += m_speed * (float)gameTime.TotalMilliseconds;
                        if (m_diff > 1)
                        {
                            m_diff = 0;
                            m_state = ETypeState.stop;
                        }
                        break;
                    }
            }
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// начало старт анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void startOnce()
        {
            m_state = ETypeState.forward;
        }
        ///--------------------------------------------------------------------------------------




         ///=====================================================================================
        ///
        /// <summary>
        /// начало старт анимации
        /// speed - скорость продолжительности анимации в милисикундах
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void startOnce(float speed)
        {
            m_speed = 1 / speed;
            m_state = ETypeState.forward;
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// начало старт анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void reset()
        {
            m_diff = 0;
            m_state = ETypeState.stop;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// остановка анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void stop()
        {
            m_diff = 0;
            m_state = ETypeState.stop;
        }
        ///--------------------------------------------------------------------------------------



        ///=====================================================================================
        ///
        /// <summary>
        /// проверка, анимация остановилась илил нет
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isStop()
        {
            return m_state == ETypeState.stop ? true : false;
        }






    }//AAnimationLoopOnce
}