using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;


using Pluton.SystemProgram;


namespace Pluton.GraphicsElement
{
    ///--------------------------------------------------------------------------------------







     ///=====================================================================================
    ///
    /// <summary>
    /// Энимационный элемент
    /// проигрывает зацикленную анимацию
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAnimation
    {
        ///--------------------------------------------------------------------------------------
        private float mSpeed = 0;   //скорость перемещения
        private float mDiff = 0;  //текущее изменение от 0 до 1;
        ///--------------------------------------------------------------------------------------









        ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// speed - скорость продолжительности анимации в милисикундах
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAnimation(float speed)
        {
            mSpeed = 1.0f / speed;
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// возвратить  текущее значение анимации от 0..1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public static implicit operator float(AAnimation p)
        {
            return p.mDiff;
        }
        ///--------------------------------------------------------------------------------------



















        ///=====================================================================================
        ///
        /// <summary>
        /// обработка анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void update(TimeSpan gameTime)
        {
            mDiff += mSpeed * (float)gameTime.TotalMilliseconds;
            if (mDiff > 1)
            {
                mDiff = 0;
            }
        }
        ///--------------------------------------------------------------------------------------









    }//AAnimationLoop
}