using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;


using Pluton.SystemProgram;


namespace Pluton.GraphicsElement
{
    ///--------------------------------------------------------------------------------------







     ///=====================================================================================
    ///
    /// <summary>
    /// Энимационный элемент
    /// проигрывает зацикленную анимацию
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAnimationLoop
    {
        ///--------------------------------------------------------------------------------------
        private float m_speed = 0;   //скорость перемещения
        private float m_diff = 0;  //текущее изменение от 0 до 1;
        private ETypeState m_state = ETypeState.forward;
        ///--------------------------------------------------------------------------------------




        ///--------------------------------------------------------------------------------------
        /// <summary>
        /// Текущее деййствия состояние машины
        /// </summary>
        protected enum ETypeState
        {
            /// <summary>
            /// анимируем в одну сторону
            /// </summary>
            forward,

            /// <summary>
            /// анимируем вдругую сторону
            /// </summary>
            backward

        };
        ///--------------------------------------------------------------------------------------






        ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// speed - скорость продолжительности анимации в милисикундах
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAnimationLoop(float speed)
        {
            m_speed = 1 / speed;
        }
        ///--------------------------------------------------------------------------------------







        ///=====================================================================================
        ///
        /// <summary>
        /// возвратить  текущее значение анимации от 0..1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public static implicit operator float(AAnimationLoop p)
        {
            return p.m_diff;
        }
        ///--------------------------------------------------------------------------------------



















        ///=====================================================================================
        ///
        /// <summary>
        /// обработка анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void update(TimeSpan gameTime)
        {
            switch (m_state)
            {
                case ETypeState.forward:
                    {
                        m_diff += m_speed * (float)gameTime.TotalMilliseconds;
                        if (m_diff > 1)
                        {
                            m_diff = 1;
                            m_state = ETypeState.backward;
                        }
                        break;
                    }

                case ETypeState.backward:
                    {
                        m_diff -= m_speed * (float)gameTime.TotalMilliseconds;
                        if (m_diff < 0)
                        {
                            m_diff = 0;
                            m_state = ETypeState.forward;
                        }
                        break;
                    }
            }
        }
        ///--------------------------------------------------------------------------------------









    }//AAnimationLoop
}