using System;
using Microsoft.Xna.Framework;
using Microsoft.Xna.Framework.Content;
using Microsoft.Xna.Framework.Graphics;


using Pluton.SystemProgram;


namespace Pluton.GraphicsElement
{
    ///--------------------------------------------------------------------------------------







     ///=====================================================================================
    ///
    /// <summary>
    /// Энимационный элемент
    /// показывает или скрывает анимацию
    /// </summary>
    /// 
    ///--------------------------------------------------------------------------------------
    public class AAnimationShow
    {
        ///--------------------------------------------------------------------------------------
        private float m_speed = 0;   //скорость перемещения
        private float m_diff = 0;  //текущее изменение от 0 до 1;
        private ETypeState m_state = ETypeState.hide;
        ///--------------------------------------------------------------------------------------




        ///--------------------------------------------------------------------------------------
        /// <summary>
        /// Текущее деййствия состояние машины
        /// </summary>
        protected enum ETypeState
        {
            /// <summary>
            /// скрыто
            /// </summary>
            hide,

            /// <summary>
            /// скрывает и анимирует 
            /// </summary>
            hideAnimat,


            /// <summary>
            /// активно показывает
            /// </summary>
            show,

            /// <summary>
            /// анимация при показе
            /// </summary>
            showAnimat

        };
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// Constructor
        /// speed - скорость продолжительности анимации в милисикундах
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public AAnimationShow(float speed)
        {
            m_speed = 1 / speed;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// возвратить  текущее значение анимации от 0..1
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public static implicit operator float(AAnimationShow p)
        {
            return p.m_diff;
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// проверка на том что анимация закончена 
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isHide()
        {
            return m_state == ETypeState.hide ? true : false;
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// анимация завершена показам анимаированного элемента
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isShow()
        {
            return m_state == ETypeState.show ? true : false;
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// првоерка, идет ли анимация показа элемента
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isShowing()
        {
            return m_state == ETypeState.showAnimat ? true : false;
        }
        ///--------------------------------------------------------------------------------------





         ///=====================================================================================
        ///
        /// <summary>
        /// првоерка, идет ли анимация
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isAnimation()
        {
            switch (m_state)
            {
                case ETypeState.hideAnimat: return true;
                case ETypeState.showAnimat: return true;
            }
            return false;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// начало показа анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void show()
        {
            m_state = ETypeState.showAnimat;
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// скрыть анимацию
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void hide()
        {
            m_state = ETypeState.hideAnimat;
        }
        ///--------------------------------------------------------------------------------------






         ///=====================================================================================
        ///
        /// <summary>
        /// проверка что идет анимация скрытости
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public bool isHiding()
        {
            return m_state == ETypeState.hideAnimat ? true : false;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// скрыть анимацию немедленно
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void setHide()
        {
            m_diff = 0;
            m_state = ETypeState.hide;
        }
        ///--------------------------------------------------------------------------------------







         ///=====================================================================================
        ///
        /// <summary>
        /// открыть анимацию немедленно
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void setShow()
        {
            m_diff = 1;
            m_state = ETypeState.show;
        }
        ///--------------------------------------------------------------------------------------








         ///=====================================================================================
        ///
        /// <summary>
        /// обработка анимации
        /// </summary>
        /// 
        ///--------------------------------------------------------------------------------------
        public void update(TimeSpan gameTime)
        {
            switch (m_state)
            {
                case ETypeState.showAnimat:
                    {
                        m_diff += m_speed * (float)gameTime.TotalMilliseconds;
                        if (m_diff > 1)
                        {
                            m_diff = 1;
                            m_state = ETypeState.show;
                        }
                        break;
                    }

                case ETypeState.hideAnimat:
                    {
                        m_diff -= m_speed * (float)gameTime.TotalMilliseconds;
                        if (m_diff < 0)
                        {
                            m_diff = 0;
                            m_state = ETypeState.hide;
                        }
                        break;
                    }
            }
        }
        ///--------------------------------------------------------------------------------------









    }//AAnimationShow
}